Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_type.h
#ifndef _RTL8735B_SYSON_TYPE_H_
#define _RTL8735B_SYSON_TYPE_H_
#include "platform_conf.h"

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOB_0_1_CTRL
 * @brief                                            (@ 0X008)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO1_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO1_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO1_DRIVING              26
#define SYSON_MASK_SYSON_GPIO1_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO1_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO1_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO1 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO1_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO1_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO1_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO1_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: USB_HSDM 0001: I2C0_SDA 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO0_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO0_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO0_DRIVING              10
#define SYSON_MASK_SYSON_GPIO0_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO0_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO0_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO0 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO0_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO0_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO0_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO0_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: USB_HSDP 0001: I2C0_SCL 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOB_2_CTRL
 * @brief                                            (@ 0X00C)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO2_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO2_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO2_DRIVING              10
#define SYSON_MASK_SYSON_GPIO2_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO2_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO2_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO2 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO2_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO2_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO2_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO2_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOC_0_1_CTRL
 * @brief                                            (@ 0X010)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO1_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO1_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO1_DRIVING              26
#define SYSON_MASK_SYSON_GPIO1_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO1_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO1_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO1 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO1_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO1_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO1_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO1_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: SPI_M_DATA3 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO0_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO0_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO0_DRIVING              10
#define SYSON_MASK_SYSON_GPIO0_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:8mA, 1:16mA */
#define SYSON_SHIFT_SYSON_GPIO0_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO0_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO0 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO0_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO0_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO0_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO0_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: SPI_M_CLK 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOC_2_3_CTRL
 * @brief                                            (@ 0X014)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO3_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO3_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO3_DRIVING              26
#define SYSON_MASK_SYSON_GPIO3_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO3_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO3_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO3 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO3_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO3_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO3_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO3_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: SPI_M_DATA2 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO2_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO2_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO2_DRIVING              10
#define SYSON_MASK_SYSON_GPIO2_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO2_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO2_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO2 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO2_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO2_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO2_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO2_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: SPI_M_DATA0 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOC_4_5_CTRL
 * @brief                                            (@ 0X018)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO5_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO5_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO5_DRIVING              26
#define SYSON_MASK_SYSON_GPIO5_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO5_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO5_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO5 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO5_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO5_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO5_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO5_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: SPI_M_CS 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO4_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO4_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO4_DRIVING              10
#define SYSON_MASK_SYSON_GPIO4_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO4_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO4_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO4 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO4_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO4_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO4_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO4_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: SPI_M_DATA1 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOD_0_1_CTRL
 * @brief                                            (@ 0X01C)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO1_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO1_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO1_DRIVING              26
#define SYSON_MASK_SYSON_GPIO1_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO1_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO1_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO1 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO1_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO1_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO1_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO1_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: MIPI_DATA0_N 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO0_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO0_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO0_DRIVING              10
#define SYSON_MASK_SYSON_GPIO0_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO0_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO0_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO0 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO0_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO0_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO0_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO0_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: MIPI_DATA0_P 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOD_2_3_CTRL
 * @brief                                            (@ 0X020)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO3_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO3_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO3_DRIVING              26
#define SYSON_MASK_SYSON_GPIO3_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO3_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO3_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO3 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO3_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO3_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO3_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO3_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: MIPI_DATA1_N 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO2_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO2_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO2_DRIVING              10
#define SYSON_MASK_SYSON_GPIO2_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO2_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO2_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO2 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO2_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO2_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO2_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO2_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: MIPI_DATA1_P 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOD_4_5_CTRL
 * @brief                                            (@ 0X024)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO5_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO5_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO5_DRIVING              26
#define SYSON_MASK_SYSON_GPIO5_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO5_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO5_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO5 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO5_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO5_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO5_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO5_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: MIPI_CKI_N 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO4_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO4_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO4_DRIVING              10
#define SYSON_MASK_SYSON_GPIO4_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO4_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO4_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO4 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO4_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO4_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO4_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO4_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: MIPI_CKI_P 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOD_6_7_CTRL
 * @brief                                            (@ 0X028)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO7_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO7_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO7_DRIVING              26
#define SYSON_MASK_SYSON_GPIO7_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO7_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO7_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO7 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO7_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO7_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO7_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO7_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: MIPI_DATA2_N 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO6_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO6_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO6_DRIVING              10
#define SYSON_MASK_SYSON_GPIO6_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO6_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO6_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO6 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO6_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO6_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO6_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO6_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: MIPI_DATA2_P 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

