Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_type.h
/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOE_8_9_CTRL
 * @brief                                            (@ 0X050)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO9_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO9_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO9_DRIVING              26
#define SYSON_MASK_SYSON_GPIO9_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO9_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO9_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO9 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO9_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO9_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO9_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO9_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: TRXQP 0001: I2C2_SCL 0010: 0011: 0100: 0101:SPI_0_CS1 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO8_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO8_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO8_DRIVING              10
#define SYSON_MASK_SYSON_GPIO8_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO8_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO8_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO8 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO8_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO8_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO8_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO8_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: TRXIN 0001: I2C2_SDA 0010: 0011:RFE_CTRL_5 0100:BT_AOX_3 0101:SPI_0_CS0 0110: UART3_CTS 0111: BT_UART_CTS 1000: SPI_2_CS 1001: BTCMC_I2C_DD 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOE_10_CTRL
 * @brief                                            (@ 0X054)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO10_SLEW_RATE           12
#define SYSON_BIT_SYSON_GPIO10_SLEW_RATE             ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO10_DRIVING             10
#define SYSON_MASK_SYSON_GPIO10_DRIVING              ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO10_SMT_EN              9
#define SYSON_BIT_SYSON_GPIO10_SMT_EN                ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO10 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO10_PULL_CTRL           6
#define SYSON_MASK_SYSON_GPIO10_PULL_CTRL            ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO10_PINMUX_SEL          0
#define SYSON_MASK_SYSON_GPIO10_PINMUX_SEL           ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: TRXQN 0001: I2C2_SDA 0010: 0011: 0100: 0101:SPI_0_CS2 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */
#else
/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOD_18_19_CTRL
 * @brief                                            (@ 0X040)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO19_SLEW_RATE           28
#define SYSON_BIT_SYSON_GPIO19_SLEW_RATE             ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO19_DRIVING             26
#define SYSON_MASK_SYSON_GPIO19_DRIVING              ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO19_SMT_EN              25
#define SYSON_BIT_SYSON_GPIO19_SMT_EN                ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO19 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO19_PULL_CTRL           22
#define SYSON_MASK_SYSON_GPIO19_PULL_CTRL            ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO19_PINMUX_SEL          16
#define SYSON_MASK_SYSON_GPIO19_PINMUX_SEL           ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: 0001: I2C1_SCL 0010: 0011: RFE_CTRL_3 0100: 0101: 0110:UART2_OUT 0111: BT_LOG 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO18_SLEW_RATE           12
#define SYSON_BIT_SYSON_GPIO18_SLEW_RATE             ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO18_DRIVING             10
#define SYSON_MASK_SYSON_GPIO18_DRIVING              ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO18_SMT_EN              9
#define SYSON_BIT_SYSON_GPIO18_SMT_EN                ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO18 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO18_PULL_CTRL           6
#define SYSON_MASK_SYSON_GPIO18_PULL_CTRL            ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO18_PINMUX_SEL          0
#define SYSON_MASK_SYSON_GPIO18_PINMUX_SEL           ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: DMIC_DATA 0010: 0011: RFE_CTRL_5 0100: BT_AOX_3 0101:I2S1_SD_RX 0110:UART2_RTS 0111: BT_MP_I2C_SDA 1000: 1001: BTCMD_IRQ 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOD_20_CTRL
 * @brief                                            (@ 0X044)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO20_SLEW_RATE           12
#define SYSON_BIT_SYSON_GPIO20_SLEW_RATE             ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO20_DRIVING             10
#define SYSON_MASK_SYSON_GPIO20_DRIVING              ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO20_SMT_EN              9
#define SYSON_BIT_SYSON_GPIO20_SMT_EN                ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO20 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO20_PULL_CTRL           6
#define SYSON_MASK_SYSON_GPIO20_PULL_CTRL            ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO20_PINMUX_SEL          0
#define SYSON_MASK_SYSON_GPIO20_PINMUX_SEL           ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: I2C1_SDA 0010: 0011: 0100: 0101: 0110: UART2_IN 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOE_0_1_CTRL
 * @brief                                            (@ 0X048)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO1_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO1_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO1_DRIVING              26
#define SYSON_MASK_SYSON_GPIO1_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO1_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO1_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO1 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO1_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO1_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO1_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO1_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: SPI_2_SCL 0001: SPI_2_SCL 0010: WIFI_UART_OUT 0011: 0100: BT_AOX_0 0101: SPI_0_SCL 0110:UART3_OUT 0111: BT_UART_OUT 1000:SPI_2_SCL 1001: SPI_2_SCL 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO0_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO0_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO0_DRIVING              10
#define SYSON_MASK_SYSON_GPIO0_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO0_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO0_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO0 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO0_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO0_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO0_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO0_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: 0001: 0010: WIFI_LED 0011: RFE_CTRL_3 0100: 0101: 0110: UART2_OUT 0111: BT_LOG 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOE_2_3_CTRL
 * @brief                                            (@ 0X04C)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO3_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO3_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO3_DRIVING              26
#define SYSON_MASK_SYSON_GPIO3_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO3_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO3_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO3 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO3_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO3_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO3_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO3_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: TRXIP 0001: I2C2_SCL 0010: 0011: RFE_CTRL_4 0100:BT_AOX_2 0101: SPI_0_MOSI 0110: UART3_RTS 0111: BT_UART_RTS 1000: SPI_2_MOSI 1001: BTCMD_I2C_CK 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO2_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO2_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO2_DRIVING              10
#define SYSON_MASK_SYSON_GPIO2_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  Wait for pad type */
#define SYSON_SHIFT_SYSON_GPIO2_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO2_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO2 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO2_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO2_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO2_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO2_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: SPI_2_MISO 0001: SPI_2_MISO 0010: WIFI_UART_IN 0011: 0100:BT_AOX_1 0101: SPI_0_MISO 0110: UART3_IN 0111: BT_UART_IN 1000: SPI_2_MISO 1001: SPI_2_MISO 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOE_4_5_CTRL
 * @brief                                            (@ 0X050)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO5_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO5_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO5_DRIVING              26
#define SYSON_MASK_SYSON_GPIO5_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO5_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO5_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO5 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO5_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO5_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO5_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO5_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000:TRXQP 0001: I2C2_SCL 0010: 0011: 0100: 0101:SPI_0_CS1 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO4_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO4_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO4_DRIVING              10
#define SYSON_MASK_SYSON_GPIO4_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO4_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO4_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO4 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO4_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO4_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO4_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO4_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: TRXIN 0001: I2C2_SDA 0010: 0011:RFE_CTRL_5 0100:BT_AOX_3 0101:SPI_0_CS0 0110: UART3_CTS 0111:BT_UART_CTS 1000:SPI_2_CS 1001: BTCMC_I2C_DD 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOE_6_CTRL
 * @brief                                            (@ 0X054)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO6_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO6_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO6_DRIVING              10
#define SYSON_MASK_SYSON_GPIO6_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO6_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO6_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO6 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO6_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO6_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO6_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO6_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000:TRXQN 0001: I2C2_SDA 0010: 0011: 0100: 0101:SPI_0_CS2 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */
#endif

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOS_0_1_CTRL
 * @brief                                            (@ 0X058)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO1_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO1_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO1_DRIVING              26
#define SYSON_MASK_SYSON_GPIO1_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO1_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO1_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO1 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO1_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO1_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO1_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO1_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: SD_D1 0001: 0010: PWM8 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO0_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO0_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO0_DRIVING              10
#define SYSON_MASK_SYSON_GPIO0_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:8mA, 1:16mA */
#define SYSON_SHIFT_SYSON_GPIO0_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO0_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO0 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO0_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO0_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO0_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO0_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: SD_CLK 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOS_2_3_CTRL
 * @brief                                            (@ 0X05C)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO3_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO3_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO3_DRIVING              26
#define SYSON_MASK_SYSON_GPIO3_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO3_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO3_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO3 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO3_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO3_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO3_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO3_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: SD_CMD 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO2_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO2_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO2_DRIVING              10
#define SYSON_MASK_SYSON_GPIO2_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO2_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO2_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO2 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO2_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO2_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO2_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO2_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: SD_D0 0001: 0010: 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

