Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_syson_type.h
/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOS_4_5_CTRL
 * @brief                                            (@ 0X060)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO5_SLEW_RATE            28
#define SYSON_BIT_SYSON_GPIO5_SLEW_RATE              ((u32)0x00000001 << 28)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO5_DRIVING              26
#define SYSON_MASK_SYSON_GPIO5_DRIVING               ((u32)0x00000003 << 26)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO5_SMT_EN               25
#define SYSON_BIT_SYSON_GPIO5_SMT_EN                 ((u32)0x00000001 << 25)                             /*!<R/W 0  Enable SYSON GPIO5 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO5_PULL_CTRL            22
#define SYSON_MASK_SYSON_GPIO5_PULL_CTRL             ((u32)0x00000003 << 22)                             /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO5_PINMUX_SEL           16
#define SYSON_MASK_SYSON_GPIO5_PINMUX_SEL            ((u32)0x0000000F << 16)                             /*!<R/W 1111  0000: SD_D3 0001: 0010: PWM10 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
#define SYSON_SHIFT_SYSON_GPIO4_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO4_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO4_DRIVING              10
#define SYSON_MASK_SYSON_GPIO4_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO4_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO4_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO4 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO4_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO4_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO4_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO4_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: SD_CD 0001: 0010:PWM9 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYSON_GPIOS_6_CTRL
 * @brief                                            (@ 0X064)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_SYSON_GPIO6_SLEW_RATE            12
#define SYSON_BIT_SYSON_GPIO6_SLEW_RATE              ((u32)0x00000001 << 12)                             /*!<R/W 0  0:Disable,1:Enable */
#define SYSON_SHIFT_SYSON_GPIO6_DRIVING              10
#define SYSON_MASK_SYSON_GPIO6_DRIVING               ((u32)0x00000003 << 10)                             /*!<R/W 0  0:4mA, 1:8mA */
#define SYSON_SHIFT_SYSON_GPIO6_SMT_EN               9
#define SYSON_BIT_SYSON_GPIO6_SMT_EN                 ((u32)0x00000001 << 9)                              /*!<R/W 0  Enable SYSON GPIO6 Schmitt trigger; 1: enable */
#define SYSON_SHIFT_SYSON_GPIO6_PULL_CTRL            6
#define SYSON_MASK_SYSON_GPIO6_PULL_CTRL             ((u32)0x00000003 << 6)                              /*!<R/W 0  2b'00: high impedence; 2b'01: pull low; 2b'10: pull high; 2b'11: reserved */
#define SYSON_SHIFT_SYSON_GPIO6_PINMUX_SEL           0
#define SYSON_MASK_SYSON_GPIO6_PINMUX_SEL            ((u32)0x0000000F << 0)                              /*!<R/W 1111  0000: SD_D2 0001: 0010: PWM11 0011: 0100: 0101: 0110: 0111: 1000: 1001: 1010: 1011: 1100: 1101: 1110: 1111: GPIO */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_OTP_AS_CTRL_NS
 * @brief                                            (@ 0X068)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_OTP_MODE_SEL                     30
#define SYSON_MASK_OTP_MODE_SEL                      ((u32)0x00000003 << 30)                             /*!<R/W 0  OTP controller Mode (command) selection Program to this field could trigger OTP controller to do related command operation. 2'b00 :Read 2'b10 :Write 2'b01 :Autoload Enable 2'b11 :Compare Secure Data Enable */
#define SYSON_SHIFT_OTP_RDY                          29
#define SYSON_BIT_OTP_RDY                            ((u32)0x00000001 << 29)                             /*!<R/W1C 0  OTP Operation Ready bit 0: OTP controller has NOT done a requested command. 1: OTP controller has done a requested command. Note : HW set , SW clear Note before any operations, HW/SW should clear ready bit first Note: For autoload operation, this bit is not used for autoload done status. Autoload done status of each zone is shown in 0x40009128[6:4] */
#define SYSON_SHIFT_OTP_COMP_RESULT                  28
#define SYSON_BIT_OTP_COMP_RESULT                    ((u32)0x00000001 << 28)                             /*!<R/W1C 0  compare result 0 : PASS 1 : FAIL Note : HW set , SW clear */
#define SYSON_SHIFT_OTP_OP_EN                        27
#define SYSON_BIT_OTP_OP_EN                          ((u32)0x00000001 << 27)                             /*!<W1Once 0  OTP controller operation enable control This bit could be set to 1 by software and automatically cleared to 0 by hardware 0: OTP controller does NOT perforam any operations even B_OTP_MODE_SEL is given by a valid value. 1: OTP controller performs corresponding operation according to B_OTP_MODE_SEL, B_OTP_ADDR and B_OTP_DATA */
#define SYSON_SHIFT_OTP_ADDR                         16
#define SYSON_MASK_OTP_ADDR                          ((u32)0x000007FF << 16)                             /*!<R/W 0  Access Address */
#define SYSON_SHIFT_RSVD1                            9
#define SYSON_MASK_RSVD1                             ((u32)0x0000007F << 9)                              /*!<R/W 0x00  Reserved */
#define SYSON_SHIFT_OTP_AUTO_RDCHK_CTRL              8
#define SYSON_BIT_OTP_AUTO_RDCHK_CTRL                ((u32)0x00000001 << 8)                              /*!<R/W 0  Automatic Read Check Control When this bit is set to 1 in OTP write mode, OTP controller would perform a write-read-check process automatically. Read back data would be compared with original write data and the result would be updated in bit28 of this register 0: Disable auto read check mechanism 1: Enable auto read check mechanism */
#define SYSON_SHIFT_OTP_DATA                         0
#define SYSON_MASK_OTP_DATA                          ((u32)0x000000FF << 0)                              /*!<R/W 0  Access Data [7:0] : Read / Write/Data to be compared */
/** @} */

/**************************************************************************//**
 * @defgroup SYSON_REG_SYS_JTAG_SWD_CTRL
 * @brief                                            (@ 0X070)
 * @{
 *****************************************************************************/
#define SYSON_SHIFT_RM3_DBG_MD_SEL                   4
#define SYSON_BIT_RM3_DBG_MD_SEL                     ((u32)0x00000001 << 4)                              /*!<R/W 0  Real-M300 SWJ-DP Mode Selection 0:SWD-DP Mode 1:JTAG-DP Mode */
#define SYSON_SHIFT_RM3_DBG_PIN_EN                   3
#define SYSON_BIT_RM3_DBG_PIN_EN                     ((u32)0x00000001 << 3)                              /*!<R/W 0  Real-M300 SWJ-DP Pinmux Function Enable 0:SWD/JTAG Pin Disable 1:SWD/JTAG Pin Enable */
#define SYSON_SHIFT_DBG_CHAIN_EN                     2
#define SYSON_BIT_DBG_CHAIN_EN                       ((u32)0x00000001 << 2)                              /*!<R/W 0  Real-M500 and Real-M300 JTAG Chain Mode Enable 0:JTAG Chain Mode Disable 1:JTAG Chain Mode Enable */
#define SYSON_SHIFT_RM5_DBG_MD_SEL                   1
#define SYSON_BIT_RM5_DBG_MD_SEL                     ((u32)0x00000001 << 1)                              /*!<R/W 0  Real-M500 SWJ-DP Mode Selection 0:SWD-DP Mode 1:JTAG-DP Mode */
#define SYSON_SHIFT_RM5_DBG_PIN_EN                   0
#define SYSON_BIT_RM5_DBG_PIN_EN                     ((u32)0x00000001 << 0)                              /*!<R/W 0  Real-M500 SWJ-DP Pinmux Function Enable 0:SWD/JTAG Pin Disable 1:SWD/JTAG Pin Enable */
/** @} */

/**************************************************************************//**
 * @defgroup rtl8735b_SYSON
 * @{
 * @brief rtl8735b_SYSON Register Declaration
 *****************************************************************************/
typedef struct {
	__O  uint32_t SYSON_REG_SYSON_GPIO_CTRL0 ;             /*!<   register,  Address offset: 0x000 */
	__O  uint32_t SYSON_REG_SYSON_GPIO_CTRL1 ;             /*!<   register,  Address offset: 0x004 */
	__IO uint32_t SYSON_REG_SYSON_GPIOB_0_1_CTRL ;         /*!<   register,  Address offset: 0x008 */
	__IO uint32_t SYSON_REG_SYSON_GPIOB_2_CTRL ;           /*!<   register,  Address offset: 0x00C */
	__IO uint32_t SYSON_REG_SYSON_GPIOC_0_1_CTRL ;         /*!<   register,  Address offset: 0x010 */
	__IO uint32_t SYSON_REG_SYSON_GPIOC_2_3_CTRL ;         /*!<   register,  Address offset: 0x014 */
	__IO uint32_t SYSON_REG_SYSON_GPIOC_4_5_CTRL ;         /*!<   register,  Address offset: 0x018 */
	__IO uint32_t SYSON_REG_SYSON_GPIOD_0_1_CTRL ;         /*!<   register,  Address offset: 0x01C */
	__IO uint32_t SYSON_REG_SYSON_GPIOD_2_3_CTRL ;         /*!<   register,  Address offset: 0x020 */
	__IO uint32_t SYSON_REG_SYSON_GPIOD_4_5_CTRL ;         /*!<   register,  Address offset: 0x024 */
	__IO uint32_t SYSON_REG_SYSON_GPIOD_6_7_CTRL ;         /*!<   register,  Address offset: 0x028 */
	__IO uint32_t SYSON_REG_SYSON_GPIOD_8_9_CTRL ;         /*!<   register,  Address offset: 0x02C */
	__IO uint32_t SYSON_REG_SYSON_GPIOD_10_11_CTRL ;       /*!<   register,  Address offset: 0x030 */
	__IO uint32_t SYSON_REG_SYSON_GPIOD_12_13_CTRL ;       /*!<   register,  Address offset: 0x034 */
	__IO uint32_t SYSON_REG_SYSON_GPIOD_14_15_CTRL ;       /*!<   register,  Address offset: 0x038 */
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	__IO uint32_t SYSON_REG_SYSON_GPIOD_16_CTRL ;          /*!<   register,  Address offset: 0x03C */
	__IO uint32_t SYSON_REG_SYSON_GPIOE_0_1_CTRL ;         /*!<   register,  Address offset: 0x040 */
	__IO uint32_t SYSON_REG_SYSON_GPIOE_2_3_CTRL ;         /*!<   register,  Address offset: 0x044 */
	__IO uint32_t SYSON_REG_SYSON_GPIOE_4_5_CTRL ;         /*!<   register,  Address offset: 0x048 */
	__IO uint32_t SYSON_REG_SYSON_GPIOE_6_7_CTRL ;         /*!<   register,  Address offset: 0x04C */
	__IO uint32_t SYSON_REG_SYSON_GPIOE_8_9_CTRL ;         /*!<   register,  Address offset: 0x050 */
	__IO uint32_t SYSON_REG_SYSON_GPIOE_10_CTRL ;          /*!<   register,  Address offset: 0x054 */
#else
	__IO uint32_t SYSON_REG_SYSON_GPIOD_16_17_CTRL ;       /*!<   register,  Address offset: 0x03C */
	__IO uint32_t SYSON_REG_SYSON_GPIOD_18_19_CTRL ;       /*!<   register,  Address offset: 0x040 */
	__IO uint32_t SYSON_REG_SYSON_GPIOD_20_CTRL ;          /*!<   register,  Address offset: 0x044 */
	__IO uint32_t SYSON_REG_SYSON_GPIOE_0_1_CTRL ;         /*!<   register,  Address offset: 0x048 */
	__IO uint32_t SYSON_REG_SYSON_GPIOE_2_3_CTRL ;         /*!<   register,  Address offset: 0x04C */
	__IO uint32_t SYSON_REG_SYSON_GPIOE_4_5_CTRL ;         /*!<   register,  Address offset: 0x050 */
	__IO uint32_t SYSON_REG_SYSON_GPIOE_6_CTRL ;           /*!<   register,  Address offset: 0x054 */
#endif
	__IO uint32_t SYSON_REG_SYSON_GPIOS_0_1_CTRL ;         /*!<   register,  Address offset: 0x058 */
	__IO uint32_t SYSON_REG_SYSON_GPIOS_2_3_CTRL ;         /*!<   register,  Address offset: 0x05C */
	__IO uint32_t SYSON_REG_SYSON_GPIOS_4_5_CTRL ;         /*!<   register,  Address offset: 0x060 */
	__IO uint32_t SYSON_REG_SYSON_GPIOS_6_CTRL ;           /*!<   register,  Address offset: 0x064 */
	__IO uint32_t SYSON_REG_OTP_AS_CTRL_NS ;               /*!<   register,  Address offset: 0x068 */
	__IO uint32_t SYSON_REG_OTP_SCAN_TEST_NS ;             /*!<   register,  Address offset: 0x06C */
	__IO uint32_t SYSON_REG_SYS_JTAG_SWD_CTRL ;            /*!<   register,          Address offset: 0x070 */
} SYSON_TypeDef;
/** @} */

#endif
